<div style="background-color:darkgreen; text-align:center; font-color:white; vertical-align: middle; padding:30px;">
<font color="white" size = 20>NBA Team Database </font>
</div>

### Instructions / Notes:

* You **may** create new Jupyter notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql 
    [SQL]` is for _multi line_ SQL queries

### The dataset contains aggregate team statistics for 1980 - 2018 NBA seasons
To start, let's look at the primary relation in the database we've prepared for you.  
Select Cell/Run All.  This will load sql and connect to the database.

In [1]:
%load_ext sql
%sql sqlite:///nba.db

In [2]:
%%sql 
SELECT * 
FROM NBA
LIMIT 5;

 * sqlite:///nba.db
Done.

[(0, 1980, 'Lakers', 1, 1, 1, 109),
 (1, 1980, 'Lakers', 2, 0, 1, 104),
 (2, 1980, 'Lakers', 3, 1, 0, 111),
 (3, 1980, 'Lakers', 4, 0, 0, 102),
 (4, 1980, 'Lakers', 5, 1, 1, 108)]

In [3]:
%%sql
-- Task1: How many records are in the NBA database?

SELECT count(*)
FROM NBA;

 * sqlite:///nba.db
Done.

[(220,)]

In [4]:
%%sql
-- Task2: How many teams are in the database?  HINT: avoid counting duplicate team names.

SELECT count(DISTINCT team) as "# Teams"
FROM NBA;

 * sqlite:///nba.db
Done.

[(13,)]

In [5]:
%%sql

-- Task3:  Display the minimum, maximum, and average points for games played by the Cavaliers. 
    
SELECT min(pts) as "low game", max(pts) as "high game", avg(pts) as "avg game"
FROM NBA
WHERE team = "Cavaliers";

 * sqlite:///nba.db
Done.

[(77, 120, 100.42857142857143)]

In [6]:
%%sql
-- Task4: How many rows are in the table for each team? 

SELECT team, count(*) as "#rows"
FROM NBA
GROUP BY team;

 * sqlite:///nba.db
Done.

[("'Heat'", 1),
 ('Bulls', 35),
 ('Cavaliers', 7),
 ('Celtics', 25),
 ('Heat', 17),
 ('Lakers', 58),
 ('Mavericks', 6),
 ('Pistons', 14),
 ('Rockets', 11),
 ('Sixers', 4),
 ('Spurs', 27),
 ('Warriorrs', 1),
 ('Warriors', 14)]

In [7]:
%%sql
-- Task5: Display the highest and average number of points that the Lakers scored each year.

SELECT year, max(pts) as "max pts", avg(pts) as "average pts"
FROM NBA
WHERE team = 'Lakers'
GROUP BY year;

 * sqlite:///nba.db
Done.

[(1980, 123, 109.5),
 (1982, 129, 112.33333333333333),
 (1985, 136, 115.83333333333333),
 (1987, 141, 115.16666666666667),
 (1988, 108, 98.71428571428571),
 (2000, 120, 104.83333333333333),
 (2001, 108, 100.6),
 (2002, 113, 106.0),
 (2009, 104, 100.6),
 (2010, 102, 90.57142857142857)]

In [8]:
%%sql

-- Task6: Show the number of games played for all teams in the database each year between 1990 and 2000 (inclusive).  

SELECT  year, count(*) as "#games"
FROM NBA
where year >= 1990 and year <= 2000
GROUP BY year

 * sqlite:///nba.db
Done.

[(1990, 5),
 (1991, 5),
 (1992, 6),
 (1993, 6),
 (1994, 7),
 (1995, 4),
 (1996, 6),
 (1997, 6),
 (1998, 6),
 (1999, 5),
 (2000, 6)]

In [9]:
%%sql

-- Task7: Do teams play better at home? A value of 1 indicates a home game, while 0 indicates away.
-- Display the average points for each team and each value of home.  Round the average to the nearest integer.
    
SELECT team, home, round(avg(pts)) as "avg points"
FROM NBA
GROUP BY team, home;

 * sqlite:///nba.db
Done.

[("'Heat'", 1, 88.0),
 ('Bulls', 0, 95.0),
 ('Bulls', 1, 99.0),
 ('Cavaliers', 0, 93.0),
 ('Cavaliers', 1, 111.0),
 ('Celtics', 0, 100.0),
 ('Celtics', 1, 111.0),
 ('Heat', 0, 93.0),
 ('Heat', 1, 102.0),
 ('Lakers', 0, 103.0),
 ('Lakers', 1, 108.0),
 ('Mavericks', 0, 95.0),
 ('Mavericks', 1, 95.0),
 ('Pistons', 0, 103.0),
 ('Pistons', 1, 100.0),
 ('Rockets', 0, 99.0),
 ('Rockets', 1, 94.0),
 ('Sixers', 0, 113.0),
 ('Sixers', 1, 108.0),
 ('Spurs', 0, 87.0),
 ('Spurs', 1, 92.0),
 ('Warriorrs', 0, 116.0),
 ('Warriors', 0, 106.0),
 ('Warriors', 1, 116.0)]

In [10]:
%%sql

-- Task8: Which teams had the most wins?  
-- Display the results in descending order of wins, and only show results for teams with more than 10 wins.
-- If you are getting an incorrect result, consider what it is you want to do with the value in the win column.
    
SELECT team, sum(win) as "total wins"
FROM NBA
GROUP BY team
HAVING "total wins" > 10
ORDER BY "total wins" desc;

 * sqlite:///nba.db
Done.

[('Lakers', 40),
 ('Bulls', 24),
 ('Spurs', 20),
 ('Celtics', 16),
 ('Heat', 12),
 ('Pistons', 12),
 ('Warriors', 12)]

In [11]:
%%sql

-- Task9: We will consider a game with more than 120 points to be a high scoring game.
-- Count the high scoring games for each team.

SELECT team, count(*) as "# high scoring games"
FROM NBA
WHERE pts > 120
GROUP BY team;

 * sqlite:///nba.db
Done.

[('Bulls', 2),
 ('Celtics', 4),
 ('Heat', 1),
 ('Lakers', 6),
 ('Pistons', 1),
 ('Warriors', 4)]

In [40]:
%%sql



-- Task10
-- Come up with  an interesting quesion about the data and write a query to answer it.
-- Your query must use one or more functions and include all clauses in SFWGHO.

 * sqlite:///nba.db
Done.

[('Mavericks', 6),
 ('Cavaliers', 7),
 ('Rockets', 11),
 ('Pistons', 14),
 ('Warriors', 14),
 ('Heat', 17),
 ('Celtics', 25),
 ('Spurs', 27),
 ('Bulls', 35),
 ('Lakers', 58)]